import keyboard
import time

def counter_strike(*args):

    wars_dict = {
        ('бич-пакет', 'бичпакет', 'бич пакет',):
            ['b', '5', '2', 'b', '3', '5', '6', '3', '5', '4', '1', 'b', 'b'],
        ('бич-мешок', 'бичмешок', 'бич мешок'): ['b', '5', '2', 'b', '3', '4', '6', '3', '5', '4', '1', 'b', 'b'],
        ('коллаж', 'ака', 'гуляш', 'эмку', 'м4'): ['b', '5', '2', 'b', '4', '2', '6', '3', '5', '4', '1', 'b', 'b'],
        ('горгулю', 'галил', 'галю'): ['b', '5', '2', 'b', '4', '1', '6', '3', '5', '4', '1', 'b', 'b'],
        ('aug', 'ауг'): ['b', '5', '2', 'b', '4', '4'],

    }

    name = ' '.join(args[0]).lower()
    for key in wars_dict.keys():
        if name in key:
            for btn in wars_dict[key]:
                keyboard.send(btn)
                time.sleep(0.1)

            break